app/controllers/greetings_controller.rb

SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    @random_message = Greeting.order('RANDOM()').first